const articleTemplate = {
  id: '1',
  slug: 'string-art',
  title: 'String Art',
  subtitle: 'Мистецтво ниток, що підкорює серця',
  description: 'Що таке String Art і чому це тренд?',
  text: [
    'String Art – це унікальна техніка створення картин за допомогою ниток і цвяхів. Вона поєднує в собі елементи графіки, геометрії та рукоділля, дозволяючи створювати справжні витвори мистецтва навіть новачкам.',
    'Цей стиль з’явився ще у XIX столітті, але сьогодні переживає справжній ренесанс. Його популярність пояснюється простотою, доступністю матеріалів і можливістю створювати унікальні картини для декору чи подарунків.',
    'Окрім естетичного задоволення, String Art також має терапевтичний ефект. Процес натягування ниток на цвяхи вимагає зосередженості та терпіння, що допомагає зняти стрес і розслабитися.',
    'Ще один важливий аспект – можливість повної творчої свободи. Ви можете обрати будь-яке зображення, змінювати кольори ниток, експериментувати з композицією та створювати справді унікальні роботи.',
  ],
  images: [
    { url: '/images/mockedData/blogImageOne.webp', alt: '' },
    { url: '/images/mockedData/blogImageTwo.webp', alt: '' },
  ],
};

function generateArticles(count: number) {
  return Array.from({ length: count }, (_, i) => ({
    ...structuredClone(articleTemplate),
    id: (i + 1).toString(),
    title: `${articleTemplate.title} (${i + 1})`,
  }));
}

export const articlesList = generateArticles(20);
